**Q1.    Write SQL query to get the second highest salary among all Employees?**

In [ ]:
SELECT MAX(Salary)
FROM HR.EMPLOYEES
WHERE Salary NOT IN (SELECT MAX(Salary) FROM HR.EMPLOYEES)

select MAX(Salary) from HR.EMPLOYEES
WHERE Salary <> (select MAX(Salary) from HR.EMPLOYEES)

SELECT Employee_Id, 
       first_Name, 
       Salary 
FROM(
   SELECT HR.EMPLOYEES.*, 
          DENSE_RANK() OVER(ORDER BY Salary DESC) as SALARY_RANK 
   FROM HR.EMPLOYEES)
WHERE SALARY_RANK =2

**Q2.    How can we retrieve alternate records from a table in Oracle?**

We can use rownum and MOD function to retrieve the alternate records from a table.

To get Even number records:

In [ ]:
SELECT * FROM (
SELECT EMP.*,
rownum rnum
FROM HR.EMPLOYEES EMP
) WHERE MOD(rnum, 2) = 0

To get Odd number records:

In [ ]:
SELECT * FROM (
SELECT EMP.*,
rownum rnum
FROM HR.EMPLOYEES EMP
) WHERE MOD(rnum, 2) = 1

**Q3.    Write a SQL Query to find Max salary and Department name from each department.**

In [ ]:
SELECT d.DEPARTMENT_NAME, MAX(nvl(e.Salary,0))
FROM HR.DEPARTMENTS d LEFT OUTER JOIN HR.EMPLOYEES e
ON e.DEPARTMENT_ID = d.DEPARTMENT_ID 
GROUP BY DEPARTMENT_NAME 
HAVING MAX(e.Salary)>0

**Q4.    Write a SQL query to find records in Table A that are not in Table B without using NOT IN operator.**

In [ ]:
SELECT * FROM Table_A
MINUS
SELECT * FROM Table_B

**Q5.    Write SQL Query to find employees that have same name and email.**

In [ ]:
SELECT FIRST_NAME, JOB_ID, COUNT(*)
FROM HR.EMPLOYEES
GROUP BY FIRST_NAME, JOB_ID
HAVING COUNT(*) > 1

**Q6.  Write SQL query to get the nth record among all Employees.**

In [ ]:
SELECT * FROM (
SELECT EMP.*,
rownum rnum
FROM HR.EMPLOYEES EMP
) WHERE rnum = 9

**Q7.    Write a Query to get Unique names of products without using DISTINCT keyword.**

In [ ]:
select distinct JOB_ID FROM HR.EMPLOYEES

select JOB_ID FROM HR.EMPLOYEES group by JOB_ID

**Q8.    Write a SQL query to maximum Zipcode from a table without using MAX or MIN aggregate functions.**

In [ ]:
SELECT DISTINCT SALARY
FROM HR.EMPLOYEES EMP 
WHERE SALARY NOT IN (
SELECT Smaller_salary.SALARY
FROM HR.EMPLOYEES Larger_salary
inner JOIN HR.EMPLOYEES Smaller_salary
ON Smaller_salary.SALARY < Larger_salary.SALARY
)

**Q9.    Given a list of employee names and email. Write a query to print a comma separated list of employee names in a email.**

In [ ]:
SELECT FIRST_NAME, LISTAGG(EMAIL, ',') WITHIN GROUP (ORDER BY EMAIL) EMAIL
FROM   HR.EMPLOYEES
GROUP BY FIRST_NAME

**Q10.    Given an Employee table with Manager_ID as column, print First name, Manager ID and Level of employees in Organization Structure?**

In [ ]:
SELECT FIRST_NAME, EMPLOYEE_ID, MANAGER_ID, LEVEL
FROM HR.EMPLOYEES
START WITH EMPLOYEE_ID = 100
CONNECT BY PRIOR EMPLOYEE_ID = MANAGER_ID;

**Q11. Write a query to get the first and last record from a table?**

In [ ]:
select * from HR.EMPLOYEES where Rownum =1

select * from HR.EMPLOYEES where RowID = (select min(RowID) from HR.EMPLOYEES);

select * from HR.EMPLOYEES where RowID = (select max(RowID) from HR.EMPLOYEES);

**Q12. Write a query to display the first ten records from a table.**

In [ ]:
select * from HR.EMPLOYEES where Rownum <=10

**Q13. Create a table with the same structure with data as in the Student table.**

In [ ]:
Create table HR.EMPLOYEES2 as Select * from HR.EMPLOYEES;

**Q14. Show only common records between two tables.**

In [ ]:
Select * from HR.EMPLOYEES;
Intersect
Select * from HR.EMPLOYEES2;

**Q15. How to find the employee with third MAX Salary using a SQL query without using Analytic Functions?**

In [ ]:
SELECT MAX(salary) as salary FROM HR.EMPLOYEES WHERE salary NOT IN (
    SELECT salary FROM(
    SELECT salary FROM HR.EMPLOYEES ORDER BY salary DESC)
    WHERE ROWNUM < 3);

**Q16. How to read LAST 5 records from a table using a SQL query?**

In [ ]:
SELECT * FROM HR.EMPLOYEES
MINUS
SELECT * FROM HR.EMPLOYEES WHERE ROWNUM <= (SELECT COUNT(*)-5 FROM HR.EMPLOYEES);

**Q17. How to read TOP 5 records from a table using a SQL query?**

In [ ]:
SELECT * FROM HR.EMPLOYEES WHERE ROWNUM <= 5;

**Q18. How to delete DUPLICATE records from a table using a SQL Query?**

In [ ]:
SELECT * FROM( 
SELECT ROWID,
       EMPLOYEE_ID,
       FIRST_NAME,SALARY,
       ROW_NUMBER() OVER(PARTITION BY FIRST_NAME  ORDER BY EMPLOYEE_ID) AS ROW_NUMBER 
FROM HR.EMPLOYEES EMP
)WHERE ROW_NUMBER > 1;

**Q19. Write a SQL Query to get the Quarter from date.**

In [ ]:
SELECT TO_CHAR(TO_DATE('10/31/2022', 'MM/DD/YYYY'), 'Q')
AS quarter
FROM DUAL

**Q20. Write a query to create an empty table from an existing table?**

In [ ]:
CREATE TABLE HR.EMPLOYEES EMP_TEST AS
SELECT * from HR.EMPLOYEES EMP
WHERE 1 > 2;

**Q21. What does UNION do? What is the difference between UNION and UNION ALL?**

UNION merges the contents of two structurally-compatible tables into a single combined table. The difference between UNION and UNION ALL is that UNION will omit duplicate records whereas UNION ALL will include duplicate records.

It is important to note that the performance of UNION ALL will typically be better than UNION, since UNION requires the server to do the additional work of removing any duplicates. So, in cases where is is certain that there will not be any duplicates, or where having duplicates is not a problem, use of UNION ALL would be recommended for performance reasons.

**Q22. Given the following tables:**

sql> SELECT * FROM runners;
+----+--------------+
| id | name         |
+----+--------------+
|  1 | John Doe     |
|  2 | Jane Doe     |
|  3 | Alice Jones  |
|  4 | Bobby Louis  |
|  5 | Lisa Romero  |
+----+--------------+

sql> SELECT * FROM races;
+----+----------------+-----------+
| id | event          | winner_id |
+----+----------------+-----------+
|  1 | 100 meter dash |  2        |
|  2 | 500 meter dash |  3        |
|  3 | cross-country  |  2        |
|  4 | triathalon     |  NULL     |
+----+----------------+-----------+

What will be the result of the query below?

In [ ]:
SELECT * FROM runners WHERE id NOT IN (SELECT winner_id FROM races)

Surprisingly, given the sample data provided, the result of this query will be an empty set. The reason for this is as follows: If the set being evaluated by the SQL NOT IN condition contains any values that are null, then the outer query here will return an empty set, even if there are many runner ids that match winner_ids in the races table.

Knowing this, a query that avoids this issue would be as follows:

In [ ]:
SELECT * FROM runners WHERE id NOT IN (SELECT winner_id FROM races WHERE winner_id IS NOT null)

**Q23. Assume a schema of Emp ( Id, Name, DeptId ) , Dept ( Id, Name).**

**If there are 10 records in the Emp table and 5 records in the Dept table, how many rows will be displayed in the result of the following SQL query:**

In [ ]:
Select * From Emp, Dept

The query will result in 50 rows as a “cartesian product” or “cross join”, which is the default whenever the ‘where’ clause is omitted.

**Q24. Write a SQL query using UNION ALL (not UNION) that uses the WHERE clause to eliminate duplicates. Why might you want to do this?**

You can avoid duplicates using UNION ALL and still run much faster than UNION DISTINCT (which is actually same as UNION) by running a query like this:

SELECT * FROM mytable WHERE a=X UNION ALL SELECT * FROM mytable WHERE b=Y AND a!=X

The key is the AND a!=X part. This gives you the benefits of the UNION (a.k.a., UNION DISTINCT) command, while avoiding much of its performance hit.

**Q25. List and explain each of the ACID properties that collectively guarantee that database transactions are processed reliably.**

**ACID (Atomicity, Consistency, Isolation, Durability)** is a set of properties that guarantee that database transactions are processed reliably. They are defined as follows:

**Atomicity**. Atomicity requires that each transaction be “all or nothing”: if one part of the transaction fails, the entire transaction fails, and the database state is left unchanged. An atomic system must guarantee atomicity in each and every situation, including power failures, errors, and crashes.

**Consistency**. The consistency property ensures that any transaction will bring the database from one valid state to another. Any data written to the database must be valid according to all defined rules, including constraints, cascades, triggers, and any combination thereof.

**Isolation**. The isolation property ensures that the concurrent execution of transactions results in a system state that would be obtained if transactions were executed serially, i.e., one after the other. Providing isolation is the main goal of concurrency control. Depending on concurrency control method (i.e. if it uses strict - as opposed to relaxed - serializability), the effects of an incomplete transaction might not even be visible to another transaction.

**Durability**. Durability means that once a transaction has been committed, it will remain so, even in the event of power loss, crashes, or errors. In a relational database, for instance, once a group of SQL statements execute, the results need to be stored permanently (even if the database crashes immediately thereafter). To defend against power loss, transactions (or their effects) must be recorded in a non-volatile memory.

**Q26. What will be the output of the below query, given an Employee table having 10 records?**

In [ ]:
BEGIN TRAN
TRUNCATE TABLE Employees
ROLLBACK
SELECT * FROM Employees

This query will return 10 records as TRUNCATE was executed in the transaction. TRUNCATE does not itself keep a log but BEGIN TRANSACTION keeps track of the TRUNCATE command.

**Q27. What is the difference between single-row functions and multiple-row functions?**

**What is the group by clause used for?**

Single-row functions work with single row at a time. Multiple-row functions work with data of multiple rows at a time.

The group by clause combines all those records that have identical values in a particular field or any group of fields.

**Q28. Imagine a single column in a table that is populated with either a single digit (0-9) or a single character (a-z, A-Z). Write a SQL query to print ‘Fizz’ for a numeric value or ‘Buzz’ for alphabetical value for all values in that column.**

Example:

['d', 'x', 'T', 8, 'a', 9, 6, 2, 'V']

…should output:

['Buzz', 'Buzz', 'Buzz', 'Fizz', 'Buzz','Fizz', 'Fizz', 'Fizz', 'Buzz']

In [ ]:
SELECT col, case when upper(col) = lower(col) then 'Fizz' else 'Buzz' end as FizzBuzz from table;

**Q29. Write an SQL query to display the text CAPONE as:**

C

A

P

O

N

E

In [ ]:
SELECT SUBSTR('CAPONE', LEVEL, 1)
FROM DUAL CONNECT BY LEVEL <= LENGTH('CAPONE');

**Q30. Given this table:**

Select * FROM Test;

ID

1

2

3

4

5
(5 rows)

**What will be the output of below snippet?**

Select SUM(1) FROM Test;

Select SUM(2) FROM Test;

Select SUM(3) FROM Test;

5

10

15

**Q31. Table is as follows:**

ID	C1	C2	C3

1	Red	Yellow	Blue

2	NULL	Red	Green

3	Yellow	NULL	Violet

**Print the rows which have ‘Yellow’ in one of the columns C1, C2, or C3, but without using OR**

In [ ]:
SELECT * FROM table
WHERE 'Yellow' IN (C1, C2, C3)

**Q32. Write a query to insert/update Col2’s values to look exactly opposite to Col1’s values.**

Col1	Col2

1       0

0	    1

0	    1

0	    1

1	    0

0	    1

1	    0

1	    0

In [ ]:
update table set col2 = case when col1 = 1 then 0 else 1 end

**Q33. How do you get the last id without the max function?**

In [ ]:
select * from hr.test where id <= all(select id from hr.test)

select * from hr.test where id >= all(select id from hr.test)

**Q34. What is the difference between IN and EXISTS?**

**IN:**

Works on List result set

Doesn’t work on subqueries resulting in Virtual tables with multiple columns

Compares every value in the result list

Performance is comparatively SLOW for larger resultset of subquery

**EXISTS:**

Works on Virtual tables

Is used with co-related queries

Exits comparison when match is found

Performance is comparatively FAST for larger resultset of subquery

**Q35. Given the following table named A:**
  
  **x**

  2

 -2

  4

 -4

 -3    

  0
  
  2
  
  **Write a single query to calculate the sum of all positive values of x and he sum of all negative values of x**

In [ ]:
select sum(case when x>0 then x else 0 end)sum_pos,sum(case when x<0 then x else 0 end)sum_neg from a;

**Q36. Given the table mass_table:**

**weight**

5.67

34.567

365.253

34

**Write a query that produces the output:**

**weight	kg	gms**

5.67	5	67

34.567	34	567

365.253	365	253

34	34	0

In [ ]:
select weight, trunc(weight) as kg, nvl(substr(weight - trunc(weight), 2), 0) as gms
from mass_table;

**Q37. Consider the Employee table below.**

**Emp_Id	Emp_name	Salary	Manager_Id**

10	Anil	50000	18

11	Vikas	75000	16

12	Nisha	40000	18

13	Nidhi	60000	17

14	Priya	80000	18

15	Mohit	45000	18

16	Rajesh	90000	–

17	Raman	55000	16

18	Santosh	65000	17

**Write a query to generate below output:**

**Manager_Id	Manager	Average_Salary_Under_Manager**

16	Rajesh	65000

17	Raman	62500

18	Santosh	53750

In [ ]:
select b.emp_id as "Manager_Id",
          b.emp_name as "Manager", 
          avg(a.salary) as "Average_Salary_Under_Manager"
from Employee a, 
     Employee b
where a.manager_id = b.emp_id
group by b.emp_id, b.emp_name
order by b.emp_id;

**Q38. Given a table TBL with a field Nmbr that has rows with the following values:**

1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1

**Write a query to add 2 where Nmbr is 0 and add 3 where Nmbr is 1.**

In [ ]:
update TBL set Nmbr = case when Nmbr = 0 then Nmbr+2 else Nmbr+3 end;

**Q39. How to find a duplicate record?**

duplicate records with one field

duplicate records with more than one field

In [ ]:
duplicate records with one field

 SELECT name, COUNT(email) 
 FROM users
 GROUP BY email
 HAVING COUNT(email) > 1 
 
duplicate records with more than one field

 SELECT name, email, COUNT(*)
 FROM users
 GROUP BY name, email
 HAVING COUNT(*) > 1

**Q40. What is the difference between char and varchar2?**

When stored in a database, varchar2 uses only the allocated space. E.g. if you have a varchar2(1999) and put 50 bytes in the table, it will use 52 bytes.

But when stored in a database, char always uses the maximum length and is blank-padded. E.g. if you have char(1999) and put 50 bytes in the table, it will consume 2000 bytes.